info = [
    {
        name: '青浦凤溪店',
        address: '上海市青浦区凤溪镇风中路49号',
        tel: '15800357476',
        mapX:121.234291,
        mapY:31.204833
    },
    {
        name: '松江新桥店',
        address: '松江区新桥镇新中街73弄11号',
        tel: '15800354720',
        mapX: 121.319548,
        mapY: 31.069147
    },
    {
        name: '松江新桥店',
        address: '松江区新桥镇新南街378号',
        tel: '15800358460',
        mapX: 121.321863,
        mapY: 31.06822
    },
    {
        name: '松江泗泾店',
        address: '松江区泗泾镇泗泾老街322号',
        tel: '15800463574',
        mapX: 121.283078,
        mapY: 31.117112
    },
    {
        name: '松江泗泾店',
        address: '松江区泗泾老街开江中路261号',
        tel: '15800903584',
        mapX: 121.283817,
        mapY: 31.117319
    },
    {
        name: '松江泗泾店',
        address: '松江区泗泾古镇开江中路342号',
        tel: '15800912497',
        mapX: 121.283078,
        mapY: 31.117112
    },
    {
        name: '松江城区店',
        address: '松江区长桥街224号',
        tel: '15800354146',
        mapX: 121.452576,
        mapY: 31.140104
    },
    {
        name: '松江城区店',
        address: '松江城区庙前街121-3号',
        tel: '15800357421',
        mapX: 121.452576,
        mapY: 31.140104
    },
    {
        name: '松江城区店',
        address: '松江区庙前街48号',
        tel: '13661732541',
        mapX: 121.239452,
        mapY: 31.01173
    },
    {
        name: '松江车墩店',
        address: '松江区车墩镇虬长路231号',
        tel: '15800350242',
        mapX: 121.315334,
        mapY: 31.021248
    },
    {
        name: '青浦重固店',
        address: '青浦区重固镇吉买盛主通道',
        tel: '15800912461',
        mapX: 121.192282,
        mapY: 31.206137
    },
    {
        name: '青浦赵巷店',
        address: '青浦区赵巷镇赵重公路55号朋联超市门口',
        tel: '15800351924',
        mapX: 121.199262,
        mapY: 31.157002
    },
    {
        name: '青浦华新店',
        address: '青浦区华新镇新凤北路425号',
        tel: '15800912474',
        mapX: 121.230149,
        mapY: 31.250674
    },
    {
        name: '青浦城区店',
        address: '青浦城区聚星街26号',
        tel: '15800354967',
        mapX: 121.119279,
        mapY: 31.152844
    },
    {
        name: '浦东周浦店',
        address: '周浦镇小上海步行街1611弄49号',
        tel: '15800906443',
        mapX:121.586037,
        mapY: 31.121434
    },
    {
        name: '浦东周浦店',
        address: '浦东新区康沈路1621号',
        tel: '15800904647',
        mapX:121.584748,
        mapY: 31.123429
    },
    /* -------开始----------*/
    {
        name: '上海旗舰店',
        address: '周浦镇中大街85号',
        tel: '15800366954',
        mapX: 121.585454,
        mapY: 31.123381
    },
    {
        name: '浦东孙桥店',
        address: '浦东新区孙桥路341号',
        tel: '15800369324',
        mapX: 121.637827,
        mapY: 31.185384
    },
    {
        name: '浦东合庆店',
        address: '浦东新区合庆镇一心玛特超市内',
        tel: '15800906143',
        mapX: 121.726023,
        mapY: 31.241382
    },
    {
        name: '浦东龚路店',
        address: '浦东新区曹路镇龚华路474号',
        tel: '15800361429',
        mapX: 121.693284,
        mapY: 31.265801
    },
    {
        name: '奉贤四团店',
        address: '上海市奉贤区四团镇四新街68号【营业时间：09:30—21:30】',
        tel: '18621295791',
        mapX: 121.725887,
        mapY: 30.945714
    },
    {
        name: '浦东高桥店',
        address: '浦东新区高桥镇石家街89号',
        tel: '13661727324',
        mapX: 121.587051,
        mapY: 31.350275
    },
    {
        name: '奉贤金汇店',
        address: '上海市奉贤区金汇镇金汇中街215号【营业时间：10:00—22:00】',
        tel: '13661441858',
        mapX: 121.50376,
        mapY: 30.988639999999997
    },
    {
        name: '浦东三林店',
        address: '浦东新区灵岩南路1094号',
        tel: '13661763541',
        mapX: 121.506396,
        mapY: 31.147794
    },
    {
        name: '浦东杨园店',
        address: '浦东区杨园镇赵高路1150号',
        tel: '15800904379',
        mapX: 121.641522,
        mapY: 31.310858
    },
    {
        name: '川沙旗舰店',
        address: '浦东新区川沙镇新源路147号',
        tel: '15800462483',
        mapX: 121.704573,
        mapY: 31.200882
    },
    {
        name: '浦东川沙店',
        address: '浦东新区川沙镇新源路154号',
        tel: '17301852945',
        mapX: 121.703329,
        mapY: 31.200622
    },
    {
        name: '浦东惠南店',
        address: '浦东新区南汇区东门大街378号',
        tel: '15800914072',
        mapX: 121.76513,
        mapY: 31.052438
    },
    {
        name: '闵行吴泾店',
        address: '闵行区吴泾镇永德路89号',
        tel: '15800357476',
        mapX: 121.473628,
        mapY: 31.049446
    },
    {
        name: '闵行吴泾店',
        address: '闵行区吴泾镇永德路118号',
        tel: '13661743441',
        mapX: 121.471963,
        mapY: 31.049211
    },
    {
        name: '闵行莘庄店',
        address: '莘庄镇莘浜路99-1号',
        tel: '15800910754',
        mapX: 121.385478,
        mapY:31.11185
    },
    {
        name: '闵行七宝店',
        address: '闵行区七宝镇青年路258号',
        tel: '18217131356',
        mapX: 121.359304,
        mapY: 31.159991
    },
    {
        name: '闵行七宝店',
        address: '闵行区七宝镇青年路244号',
        tel: '18217131356',
        mapX: 121.359304,
        mapY: 31.159991
    },
    {
        name: '闵行纪王店',
        address: '闵行区纪王镇纪信路175号',
        tel: '15800353743',
        mapX: 121.277589,
        mapY: 31.246679
    },
    {
        name: '金山枫泾店',
        address: '金山区枫泾镇中大街162号',
        tel: '15800364126',
        mapX: 121.021415,
        mapY: 30.892556
    },
    {
        name: '嘉定南翔店',
        address: '嘉定区南翔镇生产街176号小商品商场门口',
        tel: '15800915474',
        mapX: 121.315452,
        mapY: 31.299059
    },
    {
        name: '嘉定南翔店',
        address: '嘉定区南翔镇民主街185弄15号',
        tel: '15800463054',
        mapX: 121.315518,
        mapY:31.297174
    },
    {
        name: '嘉定城区店',
        address: '嘉定区城中街23号',
        tel: '15800357143',
        mapX: 121.257247,
        mapY:31.39003
    },
     {
        name: '嘉定城区店',
        address: '嘉定区清河东大街428号',
        tel: '15800354469',
        mapX: 121.257381,
        mapY:31.390084
    },{
        name: '嘉定黄渡店',
        address: '嘉定区黄渡镇新黄路69号',
        tel: '18217131928',
        mapX: 121.220858,
        mapY:31.271923
    },
    {
        name: '嘉定马陆店',
        address: '嘉定区马陆镇樱花街111弄50号',
        tel: '13661761424',
        mapX: 121.288287,
        mapY:31.333028
    },
    {
        name: '嘉定曹安店',
        address: '嘉定区曹安公路1611-15-16号',
        tel: '13661547684',
        mapX: 121.374379,
        mapY:31.257443
    },
    {
        name: '嘉定安亭店',
        address: '嘉定区安亭镇昌吉路220号',
        tel: '15800354401',
        mapX: 121.166241,
        mapY:31.301229
    }, 
    {
        name: '嘉定方泰店',
        address: '嘉定区花园浜路128号',
        tel: '13661751641',
        mapX: 121.221504,
        mapY:31.324667
    },
    {
        name: '奉贤肖塘店',
        address: '嘉定区肖塘镇沪杭公路971号一楼',
        tel: '13661750764',
        mapX: 121.449441,
        mapY:30.969553
    },
    {
        name: '奉贤肖塘店',
        address: '奉贤区肖塘镇沪杭公路1019号',
        tel: '15800355164',
        mapX: 121.449711,
        mapY:30.968553
    },
    {
        name: '奉贤西渡店',
        address: '奉贤区西渡镇沪杭公路198号',
        tel: '15800356249',
        mapX: 121.438577,
        mapY:30.998876
    },
    {
        name: '奉贤南桥店',
        address: '奉贤区南桥镇南中路131号',
        tel: '15800463784',
        mapX: 121.464587,
        mapY:30.91924
    },
    {
        name: '奉贤金汇店',
        address: '奉贤区金汇镇中街45号',
        tel: '15800354671',
        mapX: 121.506792,
        mapY:30.99398
    },
    {
        name: '奉贤奉城店',
        address: '奉贤区奉城镇南门晟丰商厦旁',
        tel: '15800673941',
        mapX: 121.652409,
        mapY:30.917039
    },
     {
        name: '奉贤奉城店',
        address: '奉贤区奉城镇南街179号',
        tel: '13661753194',
        mapX: 121.652955,
        mapY:30.91831
    },
    {
        name: '宝山淞南店',
        address: '宝山区长江南路591号',
        tel: '15800359451',
        mapX: 121.486901,
        mapY:31.343344
    },
     {
        name: '宝山罗泾店',
        address: '宝山区陈镇路96号',
        tel: '15800462940',
        mapX: 121.349523,
        mapY:31.485874
    },
     {
        name: '宝山罗店店',
        address: '宝山区罗店镇塘西街99号',
        tel: '15800462374',
        mapX: 121.349629,
        mapY:31.420024
    },
    {
        name: '宝山罗店店',
        address: '宝山区罗店镇塘西街121号',
        tel: '15800463384',
        mapX: 121.349861,
        mapY:31.425876
    },
     {
        name: '宝山大场店',
        address: '宝山区大场镇沪太路3999号',
        tel: '15800462642',
        mapX: 121.414287,
        mapY:31.334973
    },
      {
        name: '昆山陆家店',
        address: '昆山市陆家镇友谊路136号',
        tel: '13651975314',
        mapX: 121.044875,
        mapY:31.322745
    },
      {
        name: '昆山千灯店',
        address: '昆山市千灯镇尚书路156号-158号',
        tel: '15800919049',
        mapX: 121.010049,
        mapY:31.272033
    },
      {
        name: '青浦朱家角店',
        address: '青浦区朱家角镇新溪路112号',
        tel: '400-8200755',
        mapX: 121.064111,
        mapY:31.115162
    },
    {
        name: '启东汇龙镇店',
        address: '江苏省启东市汇龙镇人民中路579号-5',
        tel: '15995659669',
        mapX: 121.667755,
        mapY:31.814566
    },  
    {
        name: '嘉定曹王店',
        address: '嘉定区曹王镇曹王路8号',
        tel: '400-8200755',
        mapX: 121.311816,
        mapY:31.437871
    }, 
    {
        name: '宝山顾村店',
        address: '宝山区顾村镇水产西路979号',
        tel: '400-8200755',
        mapX: 121.419444,
        mapY:31.361121
    },
    {
        name: '宝山杨行店',
        address: '宝山区杨行镇杨泰路467号',
        tel: '400-8200755',
        mapX: 121.446478,
        mapY:31.384145
    },
    {
        name: '宝山共富店',
        address: '宝山区共富路239号',
        tel: '400-8200755',
        mapX: 121.436577,
        mapY:31.356373
    },
    {
        name: '苏州木渎店',
        address: '苏州市相城区木渎镇中市路2号',
        tel: '400-8200755',
        mapX: 120.856789,
        mapY:31.119313
    },
     {
        name: '苏州郭巷店',
        address: '苏州市吴中路郭巷镇郭巷西路47号',
        tel: '400-8200755',
        mapX: 120.674378,
        mapY:31.254842
    },
     {
        name: '松江九亭店',
        address: '松江区九亭镇九亭大街712号',
        tel: '400-8200755',
        mapX: 121.313222,
        mapY:31.156174
    },
     {
        name: '松江九亭店',
        address: '松江区九亭镇九亭大街651号',
        tel: '400-8200755',
        mapX: 121.313455,
        mapY:31.126786
    },
     {
        name: '松江九亭店',
        address: '松江区九亭镇九亭大街561号',
        tel: '400-8200755',
        mapX: 121.332091,
        mapY:31.133777
    },
     {
        name: '松江九亭店',
        address: '松江区九亭镇九亭大街521号',
        tel: '400-8200755',
        mapX: 121.33656,
        mapY:31.134955
    },
     {
        name: '青浦徐泾店',
        address: '青浦区徐泾镇京华路208号',
        tel: '400-8200755',
        mapX: 121.281527,
        mapY:31.176196
    }, 
    {
        name: '闵行颛桥店',
        address: '闵行区颛桥镇颛兴路182号',
        tel: '400-8200755',
        mapX: 121.402928,
        mapY:31.072458
    },
     {
        name: '闵行诸翟店',
        address: '上海市闵行区诸翟镇紫堤路35号',
        tel: '400-8200755',
        mapX: 121.302929,
        mapY:31.211657
    }, 
    {
        name: '闵行诸翟店',
        address: '闵行区诸翟镇紫堤路27号',
        tel: '400-8200755',
        mapX:121.30289,
        mapY:31.211506
    },
    {
        name: '闵行诸翟店',
        address: '闵行区诸翟镇31号',
        tel: '400-8200755',
        mapX:'',
        mapY:''
    }, 
    {
        name: '崇明南门店',
        address: '崇明八一路308号',
        tel: '400-8200755',
        mapX: 121.403144,
        mapY:31.628695
    },
];